In [94]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
sns.set()

# Read data

In [95]:
train = pd.read_csv('input/train.csv', index_col='PassengerId')
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [96]:
test = pd.read_csv('input/test.csv', index_col='PassengerId')
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [97]:
test.tail()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [98]:
both = pd.concat([train.drop('Survived', axis=1), test])
both.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [99]:
both.tail()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [144]:
both.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 1 to 1309
Data columns (total 16 columns):
Pclass                1309 non-null int64
Name                  1309 non-null object
Sex                   1309 non-null object
Age                   1046 non-null float64
SibSp                 1309 non-null int64
Parch                 1309 non-null int64
Ticket                1309 non-null object
Fare                  1308 non-null float64
Cabin                 295 non-null object
Embarked              1307 non-null object
Title                 1309 non-null object
Mapped Title          1309 non-null object
Family size           1309 non-null int64
Mapped SibSp          1309 non-null object
Mapped Parch          1309 non-null object
Mapped Family size    1309 non-null object
dtypes: float64(2), int64(4), object(10)
memory usage: 173.9+ KB

# Adding 'Title' category

In [100]:
def get_title(full_name):
    return full_name.split(',')[1].split('.')[0].strip()

In [101]:
train['Title'] = train['Name'].apply(get_title)
test['Title'] = test['Name'].apply(get_title)
both['Title'] = both['Name'].apply(get_title)

In [102]:
print('Training title info:')
pd.DataFrame({'Title Instances' :train['Title'].value_counts(), 
              '% survived': round(train.groupby(by='Title')['Survived'].mean()*100)}).sort_values(by='Title Instances', ascending=False)

Training title info:

              Title Instances  % survived
Mr                        517        16.0
Miss                      182        70.0
Mrs                       125        79.0
Master                     40        57.0
Dr                          7        43.0
Rev                         6         0.0
Major                       2        50.0
Col                         2        50.0
Mlle                        2       100.0
Sir                         1       100.0
Ms                          1       100.0
Capt                        1         0.0
Mme                         1       100.0
Lady                        1       100.0
Jonkheer                    1         0.0
Don                         1         0.0
the Countess                1       100.0

In [103]:
print(f"Test Title info:\n {test['Title'].value_counts()}")

Test Title info:
 Mr        240
Miss       78
Mrs        72
Master     21
Rev         2
Col         2
Dona        1
Dr          1
Ms          1
Name: Title, dtype: int64

In [104]:
pd.DataFrame({'Title Instances' :both['Title'].value_counts(), 
              'Medium age': both.groupby('Title')['Age'].median()}).sort_values(by='Title Instances', ascending=False)

              Title Instances  Medium age
Mr                        757        29.0
Miss                      260        22.0
Mrs                       197        35.5
Master                     61         4.0
Rev                         8        41.5
Dr                          8        49.0
Col                         4        54.5
Ms                          2        28.0
Major                       2        48.5
Mlle                        2        24.0
Sir                         1        49.0
Capt                        1        70.0
Mme                         1        24.0
Lady                        1        48.0
Jonkheer                    1        38.0
Dona                        1        39.0
Don                         1        40.0
the Countess                1        33.0

#### Titles conclusions:
- Main categories: Mr, Miss, Mrs, Master
- Might be able to consider as a category: Rev, Dr (each appearing 6-7 times in the training sample).  Rev - all not survived, Dr - 50% survived, above average Mr.  Although they don't behave so much like a Mr. - still think we can't learn too much from such small numbers, putting together with Mr.
- The rest appear so rarely, doesn't make sense to make conclusions based on their survival rate inside the title.  Doesn't make sense to leave as a separate category, since don't have much in common.  Splitting into categories based on gender, age and marital status.

In [106]:
both['Mapped Title'] = both['Title'].replace({'Lady': 'Mrs', 
                                              'Mme': 'Mrs',
                                              'Dona': 'Mrs',
                                              'the Countess': 'Mrs',
                                              'Ms': 'Miss', 
                                              'Mlle': 'Miss',
                                              'Sir': 'Mr',
                                              'Major': 'Mr',
                                              'Capt': 'Mr',
                                              'Jonkheer': 'Mr',
                                              'Don': 'Mr',
                                              'Col': 'Mr',
                                              'Rev': 'Mr',
                                              'Dr': 'Mr'})
both['Mapped Title'].value_counts()

Mr        783
Miss      264
Mrs       201
Master     61
Name: Mapped Title, dtype: int64

## Handling Parch (Parents, children), SibSp (Siblings, Spouces), Family size

#### Handling Parch (Parents, children)

In [109]:
print('Number of Parents/children + survival rate in training set:')
pd.DataFrame({'Parch Instances' :train['Parch'].value_counts(), 
              '% survived': round(train.groupby(by='Parch')['Survived'].mean()*100)})

Number of Parents/children survival rate in training set:

   Parch Instances  % survived
0              678        34.0
1              118        55.0
2               80        50.0
3                5        60.0
4                4         0.0
5                5        20.0
6                1         0.0

In [117]:
print(f"Number of Parents/children in testing set:\n{test['Parch'].value_counts().sort_index()}")

Number of Parents/children in testing set:
0    324
1     52
2     33
3      3
4      2
5      1
6      1
9      2
Name: Parch, dtype: int64

In [115]:
print(f"Number of Parents/children survival rate in both sets:\n{both['Parch'].value_counts().sort_index()}")

Number of Parents/children survival rate in both sets:
0    1002
1     170
2     113
3       8
4       6
5       6
6       2
9       2
Name: Parch, dtype: int64

Just looking at Parch (number of parents/children) and the survival rate, seems that the best way to group is:
- 0 separately
- 1 & 2 - either together or separately (55 vs 50% survival)
- 3 has 60% survival, but too few observations (5 in training set), so probably better to put it together with 1 & 2
- 4 and up - survival rates low, but too few observations to make definite conclusions, can put together

In [140]:
both['Mapped Parch'] = both['Parch'].replace({0: '0', 
                                              1: '1_2_3', 2: '1_2_3', 3: '1_2_3', 
                                              4: '4+', 5: '4+', 6: '4+', 9: '4+'})
both['Mapped Parch'].value_counts()

0        1002
1_2_3     291
4+         16
Name: Mapped Parch, dtype: int64

#### Handling SibSp (Siblings, Spouces)

In [116]:
print('Number of Siblings/spouces + survival rate in training set:')
pd.DataFrame({'SibSp Instances' :train['SibSp'].value_counts(), 
              '% survived': round(train.groupby(by='SibSp')['Survived'].mean()*100)})

Number of Siblings/spouces + survival rate in training set:

   SibSp Instances  % survived
0              608        35.0
1              209        54.0
2               28        46.0
3               16        25.0
4               18        17.0
5                5         0.0
8                7         0.0

In [118]:
print(f"Number of Siblings/spouces in testing set:\n{test['SibSp'].value_counts().sort_index()}")

Number of Siblings/spouces in testing set:
0    283
1    110
2     14
3      4
4      4
5      1
8      2
Name: SibSp, dtype: int64

In [119]:
print(f"Number of Siblings/spouces survival rate in both sets:\n{both['SibSp'].value_counts().sort_index()}")

Number of Siblings/spouces survival rate in both sets:
0    891
1    319
2     42
3     20
4     22
5      6
8      9
Name: SibSp, dtype: int64

Just looking at SibSp (number of siblings/spouces) and the survival rates, seems the best way to group is:
- 5 & 8 don't have enough observations, but all the others have enough observations, and quite different survival rate
- So group 5 & 8 together, all the others can leave separately.  
- Decide if to give 5 & 8 the same number, and leave this feature numerical, or split into categories

In [137]:
both['Mapped SibSp'] = both['SibSp'].replace({0: '0', 1: '1', 2: '2', 3: '3', 4: '4', 
                                              5: '5+', 
                                              8: '5+'})
both['Mapped SibSp'].value_counts().sort_index()

0     891
1     319
2      42
3      20
4      22
5+     15
Name: Mapped SibSp, dtype: int64

#### Adding new category Family size (1 + SibSp + Parch)

In [121]:
train['Family size'] = 1 + train['Parch'] + train['SibSp']
test['Family size'] = 1 + test['Parch'] + test['SibSp']
both['Family size'] = 1 + both['Parch'] + both['SibSp']

In [122]:
print('Number of Family members + survival rate in training set:')
pd.DataFrame({'Family members Instances' :train['Family size'].value_counts(), 
              '% survived': round(train.groupby(by='Family size')['Survived'].mean()*100)})

Number of Family members + survival rate in training set:

    Family members Instances  % survived
1                        537        30.0
2                        161        55.0
3                        102        58.0
4                         29        72.0
5                         15        20.0
6                         22        14.0
7                         12        33.0
8                          6         0.0
11                         7         0.0

In [123]:
print(f"Number of Family members in testing set:\n{test['Family size'].value_counts().sort_index()}")

Number of Family members in testing set:
1     253
2      74
3      57
4      14
5       7
6       3
7       4
8       2
11      4
Name: Family size, dtype: int64

In [124]:
print(f"Number of Family members in both sets:\n{both['Family size'].value_counts().sort_index()}")

Number of Family members in both sets:
1     790
2     235
3     159
4      43
5      22
6      25
7      16
8       8
11     11
Name: Family size, dtype: int64

Just looking at Family Size and the survival rates, seems the best way to group is:
- 1
- 2 & 3
- 4
- 5, 6, 7
- 8 and more 

It's clear that there will be high correlation between these 3 categories (there are 2 more categories below that will also have high correlation, number with same last name, and number with same ticket number).  Can let the models to actually choose what's the most important categories

In [142]:
both['Mapped Family size'] = both['Family size'].replace({1: '1', 
                                                          2: '2_3', 3: '2_3', 
                                                          4: '4', 
                                                          5: '5_6_7', 6: '5_6_7', 7: '5_6_7',
                                                          8: '8+', 11: '8+'})
both['Mapped Family size'].value_counts().sort_index()

1        790
2_3      394
4         43
5_6_7     63
8+        19
Name: Mapped Family size, dtype: int64

## New Deck feature

In [162]:
def set_deck(df):
    df['Cabin'] = df['Cabin'].fillna('unknown')
    df['Deck'] = df['Cabin'].apply(lambda cab: cab[0] if (cab != 'unknown') else cab)
set_deck(train)
set_deck(test)
set_deck(both)
print(f'Set Deck for train, test and both')

Set Deck for train, test and both

In [163]:
print('Number of people per Deck + survival rate in training set:')
pd.DataFrame({'Number people on Deck': train['Deck'].value_counts(), 
              '% survived': round(train.groupby(by='Deck')['Survived'].mean()*100)})

Number of people per Deck + survival rate in training set:

         Number people on Deck  % survived
A                           15        47.0
B                           47        74.0
C                           59        59.0
D                           33        76.0
E                           32        75.0
F                           13        62.0
G                            4        50.0
T                            1         0.0
unknown                    687        30.0

In [166]:
print(f"Number of people on deck in testing set:\n{test['Deck'].value_counts().sort_index()}")

Number of people on deck in testing set:
A            7
B           18
C           35
D           13
E            9
F            8
G            1
unknown    327
Name: Deck, dtype: int64

In [167]:
print(f"Number of people on deck in both sets:\n{both['Deck'].value_counts().sort_index()}")

Number of people on deck in both sets:
A            22
B            65
C            94
D            46
E            41
F            21
G             5
T             1
unknown    1014
Name: Deck, dtype: int64

Based on survival rate and number of people in every group, it makes sense to group it in the following way:
- T to put with unknown - not enough people in the group
- B, D, E - put together - around 75%
- C, F - put together - around 60%
- A, G - around 50%

In [168]:
both['Mapped Deck'] = both['Deck'].replace({'unknown': 'unknown_T', 'T': 'unknown_T',
                                            'B': 'BDE', 'D': 'BDE', 'E': 'BDE', 
                                            'C': 'CF', 'F': 'CF',
                                            'A': 'AG', 'G': 'AG'})
both['Mapped Deck'].value_counts().sort_index()

AG             27
BDE           152
CF            115
unknown_T    1015
Name: Mapped Deck, dtype: int64

## Obvious add a category for Pclass

In [169]:
print('Number of people per Pclass + survival rate in training set:')
pd.DataFrame({'Number people per Pclass': train['Pclass'].value_counts(), 
              '% survived': round(train.groupby(by='Pclass')['Survived'].mean()*100)})

Number of people per Pclass + survival rate in training set:

   Number people per Pclass  % survived
1                       216        63.0
2                       184        47.0
3                       491        24.0

In [170]:
print(f"Number of people per class in testing set:\n{test['Pclass'].value_counts().sort_index()}")

Number of people per class in testing set:
1    107
2     93
3    218
Name: Pclass, dtype: int64

In [172]:
print(f"Number of people per class in both sets:\n{both['Pclass'].value_counts().sort_index()}")

Number of people per class in both sets:
1    323
2    277
3    709
Name: Pclass, dtype: int64

**Conclusion**: there are enough people all classes, and survival rates differ per class

In [ ]:
##